src/cf/ChartsOfCharacteristicTypes/ВопросыПоТехническимПроектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ВопросыПоТехническимПроектам</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
				<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
				<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
				<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>10</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1000</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяТочкаТехническогоПроекта</Name>
					<Comment>Контрольная точка технического проекта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтрольныеТочкиТехническихПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуален</Name>
					<Comment>Актуален</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/ChartsOfCharacteristicTypes/ВопросыПоТехническимПроектам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция возвращает массив актуальных вопросоп
// Элементами массива является структура, содержащая реквизиты вопроса
//
Функция СписокАктуальныхВопросов(Проект) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВопросыПоТехническимПроектам.Ссылка КАК Вопрос,
	|	ВопросыПоТехническимПроектам.ТипЗначения КАК ТипЗначения,
	|	ВопросыПоТехническимПроектам.КонтрольнаяТочкаТехническогоПроекта КАК КонтрольнаяТочка,
	|	ВопросыПоТехническимПроектам.ПолныйКод КАК ПолныйКод
	|ИЗ
	|	ПланВидовХарактеристик.ВопросыПоТехническимПроектам КАК ВопросыПоТехническимПроектам
	|ГДЕ
	|	НЕ ВопросыПоТехническимПроектам.ПометкаУдаления
	|	И НЕ ВопросыПоТехническимПроектам.ЭтоГруппа
	|	И ВопросыПоТехническимПроектам.Актуален
	|	И ВопросыПоТехническимПроектам.Проект = &Проект
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПолныйКод"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	МассивВопросов = Новый Массив();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураРеквизитов = Новый Структура("Вопрос,ТипЗначения,КонтрольнаяТочка,ПолныйКод");
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
		МассивВопросов.Добавить(СтруктураРеквизитов);
	КонецЦикла;
	
	Возврат МассивВопросов;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Проект)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
